<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>

<html lang="">
<!-- To declare your language - read more here: https://www.w3.org/International/questions/qa-html-language-declarations -->
<head>
<title>Nekmit | Pages | Full Width</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <script type="text/javascript" src="https://code.jquery.com/jquery-3.5.0.min.js"></script>
  <script type="text/javascript" src="https://openapi.map.naver.com/openapi/v3/maps.js?ncpClientId=c9cj503lur"></script>
<link href="../layout/styles/layout.css" rel="stylesheet" type="text/css" media="all">
<script>

$(function(){
var mapOptions = {
	    center: new naver.maps.LatLng(37.3595704, 127.105399),
	    zoom: 10
	};
//지도를 삽입할 HTML 요소 또는 HTML 요소의 id를 지정합니다.
var mapDiv = document.getElementById('map'); // 'map'으로 선언해도 동일

//옵션 없이 지도 객체를 생성하면 서울 시청을 중심으로 하는 16 레벨의 지도가 생성됩니다.
var map = new naver.maps.Map(mapDiv,mapOptions);
	
});
</script>
</head>
<body id="top">
<div class="bgded overlay" style="background-image:url('../images/demo/backgrounds/bicycleboard.jpg');
	background-repeat:no-repeat;
	background-size:100% 130%;"> 
  <!-- ################################################################################################ -->
  <!-- ################################################################################################ -->
  <!-- ################################################################################################ -->
   <div id="loginheader"   class=""  style="margin-right:60px; margin-top:0px;width:100%; height:50px;">
		<nav id="mainav" class="fl_right"> 
		<%if(session.getAttribute("id")==null) {%>
			   	<li><a href="./login.jsp">로그인</a></li>
			   	<%}else{ %>
			   	<li><a href="./logout.jsp">로그아웃</a></li>		   	
			   	<%} %>
		        <li><a href="./signup.jsp">회원가입</a></li>
		        <li><a href="#">마이페이지</a></li>
		</nav>
	  </div>
	  <!-- ################################################################################################ -->
	  <!-- ################################################################################################ -->
	  <!-- ################################################################################################ -->
	  <header id="header" class="hoc clear">
	    <div id="logo" class="fl_left"> 
	      <!-- ################################################################################################ -->
	      <h1><a href="../index.jsp" style="font-family:맑은 고딕;">자전거 정보</a></h1>
	      <!-- ################################################################################################ -->
	    </div>
	    <nav id="mainav" class="fl_right"> 
	      <!-- ################################################################################################ -->
	      
	        <li><a href="#">전국 대여소 조회</a></li>
	        <li><a href="#">자전거 길</a></li>
	        <li><a href="#">중고장터</a></li>
	        <li><a href="./gallery.jsp">자전거 갤러리</a></li>
	        <li><a href="./community.jsp">커뮤니티</a></li>
	        <li><a href="#">FAQ</a></li>
	      </ul>
	      <!-- ################################################################################################ -->
	    </nav>
	  </header>
	  <!-- ################################################################################################ -->
	  <!-- ################################################################################################ -->
	  <!-- ################################################################################################ -->
	 
	  <!-- ################################################################################################ -->
  <!-- ################################################################################################ -->
  <!-- ################################################################################################ -->
  <!-- ################################################################################################ -->
  <div id="breadcrumb" class="hoc clear"> 
    <!-- ################################################################################################ -->
    <ul>
      <li><a href="#">Home</a></li>
      <li><a href="#">Lorem</a></li>
      <li><a href="#">Ipsum</a></li>
      <li><a href="#">Dolor</a></li>
    </ul>
    <!-- ################################################################################################ -->
  </div>
  <!-- ################################################################################################ -->
</div>
<!-- End Top Background Image Wrapper -->
<!-- ################################################################################################ -->
<!-- ################################################################################################ -->
<!-- ################################################################################################ -->

<div class="wrapper row3">
  <main class="hoc container clear"> 
    <!-- main body -->
    <!-- ################################################################################################ -->
    <div class="content"> 
    	
    	<div id="map" style="width:100%;height:400px;"></div>
    	
    	</div>
    </div>
    <!-- ################################################################################################ -->
    <!-- / main body -->
    <div class="clear"></div>
  </main>
</div>

<!-- ################################################################################################ -->
<!-- ################################################################################################ -->
<!-- ################################################################################################ -->
<div class="wrapper row5">
  <div id="copyright" class="hoc clear"> 
    <!-- ################################################################################################ -->
    <p class="fl_left">Copyright &copy; 2018 - All Rights Reserved - Sungsu An<a href="#">Domain Name</a></p>
    
    <!-- ################################################################################################ -->
  </div>
</div>
<!-- ################################################################################################ -->
<!-- ################################################################################################ -->
<!-- ################################################################################################ -->
<a id="backtotop" href="#top"><i class="fas fa-chevron-up"></i></a>
<!-- JAVASCRIPTS -->
<script src="../layout/scripts/jquery.min.js"></script>
<script src="../layout/scripts/jquery.backtotop.js"></script>
<script src="../layout/scripts/jquery.mobilemenu.js"></script>
</body>
</html>